var nav_items = [
  {"title": "最新消息", "state": "content.news"},
  {"title": "如何報名", "state": "content.register"},
  {"title": "詳細資訊", "state": "content.info"},
  {"title": "照片回顧", "state": "content.photo"},
  {"title": "常見問題", "state": "content.faq"}
];

var news = [
  {
    "title": "網站測試中", 
    "paragraphs": [
      "請各位大大多多踩踩看看"
    ]
  }
];

var faqs = [
  {
    "question": "是怎樣的人可以來參加台大電機營呢？\
    我很有興趣但是我功課不夠好，這樣有機會嘛？有特別的錄取標準嗎？", 
    "paragraphs": [
      "我們的錄取標準主要看的是熱忱，也就是大家填寫的書面資料，再來是地區，\
      我們會希望各地區的人都能參加台大電機營，故會依照地區比例錄取學員。\
      基本上每年報名的人數都會是錄取人數的好幾倍，所以若是不幸沒有參加到今年的營隊，\
      也請不要灰心。若是成功出現在錄取名單中，則是提前恭喜你將會有個最充實的六天五夜！",
      "(總召的悄悄話：雖然報名表裡的三個問題都是文字敘述，但是我們鼓勵各位發揮創意，\
      所以回答的型式和內容則是沒有限制喔！另外，希望同學們都可以負責地自己填寫報名表，\
      不要交由別人代填唷！)"
    ]
  },
  {
    "question": "請問能再公佈詳細活動內容嗎？", 
    "paragraphs": [
      "活動內容基本上都列在「詳細資訊」裡囉！\
      但是為了營隊的趣味性和新鮮感，詳細的時間流程和行程不會事先公佈，\
      來參加營隊就會知道囉！",
      "在營隊的過程中，小隊員的安全是我們第一順位的考量，\
      如果小隊員有任何健康狀況需要特別注意，可以加註於報名表中。"
    ]
  },
  {
    "question": "所繳的費用包括所有的食宿嗎？", 
    "paragraphs": [
      "是的。但是不包括第一天的午餐和最後一天的晚餐及住宿。\
      我們的營隊是從 7/22 中午開始到 7/27 下午約三點左右結束。\
      此外，是錄取後才繳費。繳費的細節會在錄取後公佈在網站上。"
    ]
  },
  {
    "question": "今年的費用是不是比以往還貴？有什麼原因嗎？", 
    "paragraphs": [
      "今年的台大電機營為了反應食宿成本的上漲，因此不得已在報名費上做了反應。\
      我們不是一個以營利為目的的營隊，「所有的報名收入」都會花在小隊員身上，敬請各位見諒。"
    ]
  },
  {
    "question": "台北人能不能回家住？", 
    "paragraphs": [
      "我們都是團體活動，希望培養小隊員的團體精神，一起住宿是一個增進大家感情的好方法。\
      若沒有特殊理由，原則上希望小隊員能配合住宿。本次的住宿地點為台北國軍英雄館。"
    ]
  },
  {
    "question": "會不會有自由時間給我們玩勒？", 
    "paragraphs": [
      "沒有。六天的行程都是全程規劃好的，相當緊湊精采，一定會讓每位小隊員收穫良多。"
    ]
  },
  {
    "question": "住在東部或中南部地區的學生是否前一天就要上來？", 
    "paragraphs": [
      "我們營隊是從7/22當天中午才開始，若前一天沒有台北的親戚家可以投宿，\
      可以考慮坐當天早上早班的大眾運輸上台北，我們在火車站等下車地點都會派人接送至集合地點，請不用擔心。"
    ]
  },
];

var intro = {
  "paragraphs": [
    "佇立在人生的十字路口，不知何去何從？面對眼花撩亂的科系抉擇，\
    覺得迷茫失去自我？漫漫長假，不願在家虛度光陰？臺大電機營一定讓你滿載而歸！",
    "一連六天，有充實的電子電路實驗、電腦程式教學，更有寓教於樂、精彩刺激的冒險遊戲，\
    還會參訪電機領域的知名大廠，一窺電機產業的頂尖科技！滿滿的新奇體驗，你還在等什麼？\
    趕快報名參加 2014 台大電機營！"
  ]
};

var info = [
  {
    "title": "活動內容",
    "paragraphs": [
      "時間：2014/07/19 ~ 2014/07/24",
      "地點：國立台灣大學 : 臺北市羅斯福路四段一號",
      "住宿：台北國軍英雄館 : 台北市長沙街一段20號",
      "費用：6600元",
      "對象：全台灣高中生(含應屆畢業生)",
    ]
  },
  {
    "title": "聯絡我們",
    "paragraphs": [
      "Line ID : 2014eecamp",
      "Email: 2014eecamp@gmail.com",
      "總召：王敦儒、賴映安、林千又"
    ]
  },




];
